MOD = 998244353


# 考察
# 1. 問題の順列は priority queue による頂点の探索順
# 2. Q[i] は i 番目までに queue に追加されている必要がある。
# 3. 逆に、いつから入っていて良い？自分より小さいものがないのに i 以前に追加されると i 番目にアクセスされることはない
# 4. つまり、自分より大きい頂点がアクセスされる間は queue に入ってはいけない。
# 5. どうやって、制御する？
# 6. Q[i] が queue に入る = Q[i] の親が処理される
# 7. 頂点 1 を根とする木は各頂点の親が決まれば一意に決まる
# 8. つまり、親子関係を数えれば答えはもとまる。
# 9. つまり、Q[i] の親を何にできるかが求まれば答えももとまる。
# 10. そして、Q[i] の親を何にできるかは (4,5,6) の通り、Q[i] より大きい頂点がアクセスされるあとに入らないといけない。
# 11. つまり、Q[i] の親が Q[j] (j < i) とすると Q[j+1], ..., Q[i-1] は全て A[i] より小さくないといけない
# 12. 逆に、Q[i] の親は j+1, ..., i-1 が全て Q[i] が小さいならなれる。 => 直前の自分より大きい頂点だけ見ていれば良い。
# 13. 各 i について、Q[i] の直前の自分より小さい値を管理する場合、単調なので O(N) で管理できる


N = int(input())
(*Q,) = map(int, input().split())

ans = 1
stack = []  # 現在見ている頂点より大きいものだけが残る
for i, v in enumerate(Q, start=1):
    while stack and stack[-1][0] < v:
        stack.pop()

    # 親候補
    p = stack[-1][1] if stack else 0
    if i >= 2:
        ans = ans * (i - max(1, p)) % MOD

    stack.append((v, i))
print(ans)
